# Assignment 2

# MAS DSE200

## Instructions

* The answers to the questions should be submitted on github. 
* You donâ€™t need to explain your approach (unless specified) so please be concise in your submission. 
* To obtain full marks for a question, both the answer and the code should be correct. 
* Completely wrong (or missing) code with correct answer will result in zero marks. 
* Please code the solution in the space provided.

### Imports

Import necessary packages

In [7]:
import pandas as pd
import numpy as np

## Part 1: Pandas Series and Dataframes

**1.1**: Create a Series, called bank, with a list of floats as the data and a list of names (strings) as the index. The number of entries and their values is up to you, just make it at least 3 elements. 
The idea is something like this, where the top row is the index and the bottom row is the data.<br>


<table>
 <thead>
     <th>Jim</th>
     <th>Pam</th>
     <th>Michael</th>
 </thead>
 <tbody>
     <th>100.0</th>
     <th>150.0</th>
     <th>110.0</th>     
 <tbody>

In [8]:
bank = pd.Series(data=[100.0, 150.0, 110.0], index=["Jim", "Pam", "Michael"])
print(bank)

Jim        100.0
Pam        150.0
Michael    110.0
dtype: float64

**1.2**: Double the money of everyone in the bank!

In [9]:
bank = bank * 2
print(bank)

Jim        200.0
Pam        300.0
Michael    220.0
dtype: float64

**1.3**: Let's pretend that the bank Series pertains to the checking account of these people. Let's also say we now want to give them all a savings account. 

First, let's use this Series to create a DataFrame. 
Print the DataFrame as well as its shape.

In [10]:
bank_df = pd.DataFrame(bank)
print(bank_df)
print(bank_df.shape)

             0
Jim      200.0
Pam      300.0
Michael  220.0
(3, 1)

**1.4**: Now, add a new column to your dataframe. Make sure it's a list of float values that has the same length as the number of people in your original Series. Rename the columns to `checking` and `savings`

In [11]:
bank_df[1] = [100., 100., 100.]
bank_df.columns = ['checkings', 'savings']
print(bank_df)

         checkings  savings
Jim          200.0    100.0
Pam          300.0    100.0
Michael      220.0    100.0

## Part 2: Occupations Dataset

Grab the dataset and store it in a Pandas dataframe called `users`

In [12]:
users = pd.read_csv('./occupations.csv')
print(users.columns.values)

['user_id' 'age' 'gender' 'occupation' 'zip_code']

**2.1**: Print the first 10 entries in the dataframe to see what the columns are and what some values will look like

In [13]:
users.head(10)

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator    05201
8        9   29      M        student    01002
9       10   53      M         lawyer    90703

**2.2**: Next, set the index of the dataframe to the `user_id` column, and print the first 10 elements again to ensure the change took place

In [16]:
try:
    users.set_index('user_id', inplace=True)
except KeyError:
    print("Index already set")
users.head(10)

Index already set

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

**2.3**: How many samples are there in this dataset?

In [17]:
len(users)

943

**2.4**: What is the **most** popular occupation according to this dataset?

In [18]:
users.occupation.value_counts().head()

student          196
other            105
educator          95
administrator     79
engineer          67
Name: occupation, dtype: int64

**2.5**: What is the **least** popular occupation according to this dataset

In [19]:
users.occupation.value_counts().tail()

salesman     12
lawyer       12
none          9
doctor        7
homemaker     7
Name: occupation, dtype: int64

**2.6**: How many zip codes exist in the dataset?

In [20]:
len(users.zip_code.unique())

795

**2.7**: Find the top 100 zip codes in which the most users live. **Report these zip codes**, and then **calculate the total number of users** living in these 100 zip codes.

In [21]:
top_zip_codes_with_counts = users.zip_code.value_counts().head(100)
population_sum = sum(top_zip_codes_with_counts)
top_zip_codes = top_zip_codes_with_counts.keys()
print("The most popular zip codes in the dataset are: ", top_zip_codes)
print(population_sum, "of the users live in these zip codes")

The most popular zip codes in the dataset are:  Index(['55414', '55105', '55337', '20009', '10003', '55454', '55408', '27514',
       '11217', '02215', '61801', '80525', '22902', '55106', '61820', '94043',
       '63108', '55113', '60201', '55108', '14216', '97301', '48103', '62901',
       '55104', '10021', '22903', '55409', '55422', '30067', '10022', '83814',
       '02146', '94618', '10025', '55369', '02139', '92626', '00000', '98006',
       '38115', '33884', '94086', '98027', '92629', '91711', '94533', '10960',
       '94306', '80526', '49512', '48197', '50613', '46260', '90034', '77845',
       '01720', '20755', '61755', '53211', '60402', '91206', '80123', '77042',
       '98072', '60630', '85711', '78741', '93555', '53706', '78212', '90210',
       'T8H1N', '43212', '10019', '83702', '44224', '91344', '44212', '99709',
       '14627', '60089', '22911', '21114', '11231', '10016', '55406', '48118',
       '22206', '02154', '85282', '53711', '32301', '91201', '78704', '20003',
       '45218', '68767', '21218', '55116'],
      dtype='object')
246 of the users live in these zip codes

**2.8**: Create a new dataset, called `users_filtered`, that includes only entries of users in these top 100 zip codes. **Report the number of samples** in the original dataset and in the new dataset to ensure the desired effect took place

**hint:** Check out the Pandas Series function [isin](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.isin.html)

In [22]:
users_filtered = users[users.zip_code.isin(top_zip_codes)]
print("Before:", len(users))
print("After:", len(users_filtered))

Before: 943
After: 246

**2.9**: What is the minimum, maximum and average age of users in the top 100 zip codes?

In [23]:
print('std:',  users_filtered['age'].std())
print('mean:', users_filtered['age'].mean())
print('min:',  users_filtered['age'].min())
print('max:',  users_filtered['age'].max())
stddev = users_filtered['age'].std()
mean = users_filtered['age'].mean()

std: 11.829539816834886
mean: 33.113821138211385
min: 13
max: 70

**2.10**: How many users in the top 100 zip codes are within one standard deviation of the mean age calculated in **2.9**?

In [24]:
within_std = users_filtered[users_filtered.age.gt(mean - stddev) & users_filtered.age.lt(mean + stddev)]
print(len(within_std), 'of the original', len(users_filtered))

163 of the original 246

**2.11**: How many of the users found in **2.10** are female students?

In [25]:
print(len(within_std[(within_std.gender == 'F') & (within_std.occupation == 'student')]))

4

## Part 3: Alcohol Consumption Dataset

In [26]:
drinks = pd.read_csv('./drinks.csv', sep=',')

**3.1**: Print the first 10 entries in the dataframe

In [32]:
drinks.head(10)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0000
1,Albania,89,132,54,4.8675
2,Algeria,25,0,14,0.6903
3,Andorra,245,138,312,12.3015
4,Angola,217,57,45,5.6463
5,Antigua & Barbuda,102,128,45,4.8675
6,Argentina,193,25,221,7.7703
7,Armenia,21,179,11,3.7347
8,Australia,261,72,212,9.6465
9,Austria,279,75,191,9.6465

**3.2**: What country has the highest number of beer servings, and what is thus number? What countries consume no beer?

In [28]:
top_beer_country = drinks[drinks.beer_servings == drinks.beer_servings.max()]['country'].item()
top_beer_servings = drinks[drinks.beer_servings == drinks.beer_servings.max()]['beer_servings'].item()
no_beer_countries = drinks[drinks.beer_servings == 0]['country'].tolist()

print("{} has the most beer consumption, with {} servings".format(top_beer_country, top_beer_servings))
print("These countries consume no beer: ", no_beer_countries)

Namibia has the most beer consumption, with 376 servings
These countries consume no beer:  ['Afghanistan', 'Bangladesh', 'Cook Islands', 'Iran', 'Kuwait', 'Libya', 'Maldives', 'Marshall Islands', 'Mauritania', 'Monaco', 'North Korea', 'Pakistan', 'San Marino', 'Saudi Arabia', 'Somalia']

**3.3**: What country has the highest overall alcohol consumption?<br> 
Please calculate in terms of the sum of their beer, wine and spirit servings

In [33]:
max_consumption = (drinks.beer_servings + drinks.spirit_servings + drinks.wine_servings).max()
filt = (drinks.beer_servings + drinks.spirit_servings + drinks.wine_servings ) == max_consumption
top_drinkers = drinks[filt]
top_drinkers

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
46,Denmark,224,251,278,13.3281

**3.4**: What country or countries consume(s) the least alcohol, not counting the countries that don't drink at all?<Br>
Calculate either in terms of the sum of beer, spirit and wine servings or in terms of the total litres of pure alcohol.

In [34]:
drinkers = drinks[(drinks.beer_servings + drinks.spirit_servings + drinks.wine_servings) > 0]
min_consumption = (drinkers.beer_servings + drinkers.spirit_servings + drinkers.wine_servings).min()
filt = (drinkers.beer_servings + drinkers.spirit_servings + drinkers.wine_servings) == min_consumption
drinkers[filt]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
37,Comoros,1,3,1,0.0885
146,Saudi Arabia,0,5,0,0.0885

**3.5**: You should see from question 8 that there's a country that consumes spirits and not beer or wine. Are there countries that consumes beer and wine and not spirits? If so, what countries?

In [35]:
drinks[(drinks.beer_servings > 0) & (drinks.spirit_servings == 0) & (drinks.wine_servings > 0)]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
2,Algeria,25,0,14,0.6903
54,Equatorial Guinea,92,0,233,5.7525
62,Gambia,8,0,1,0.1593
69,Guinea,9,0,2,0.1947
91,Laos,62,0,123,3.2745
119,Nauru,49,0,8,1.0089